// --------------------------------------------------------------------------------------------------------------------
// <copyright file="ISyncTarget.cs" company="ИНИТ-центр">
//   ИНИТ-центр, 2014г.
// </copyright>
// <summary>
//   Интерфейс синхронизируемого объекта
// </summary>
// --------------------------------------------------------------------------------------------------------------------

namespace Init.DAL.Sync
{
    using Init.DAL.Sync.Strategy;

    /// <summary>
    /// Интерфейс синхронизируемого объекта
    /// </summary>
    public interface ISyncTarget
    {
        /// <summary>
        /// Стратегия синхронизации кэша
        /// </summary>
        SyncStrategy SyncStrategy { get; }
    }
}