// --------------------------------------------------------------------------------------------------------------------
// <copyright file="DbAttribute.cs" company="ИНИТ-центр">
//   ИНИТ-центр, 2013г.
// </copyright>
// <summary>
//   Базовый класс атрибута БД
// </summary>
// --------------------------------------------------------------------------------------------------------------------

namespace Init.DbCore.Metadata
{
    using System;

    /// <summary>
    /// Базовый класс атрибута БД
    /// </summary>
    public abstract class DbAttribute : Attribute
    {
    }
}